gcc -g p10original.c
îº§ gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) b main
Breakpoint 1 at 0x772: file p10original.c, line 10.
(gdb) r
Starting program: /home/runner/test-1-vishal844579/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p10original.c:10
10  {
(gdb) n
12    printf("for the first complex number\n");
(gdb) n
for the first complex number
13    printf("enter the real and imaginary parts\n");
(gdb) n
enter the real and imaginary parts
14    scanf("%f %f",&a.real,&a.img);
(gdb) n
5 6
15    printf("for the second complex number\n");
(gdb) n
for the second complex number
16    printf("enter the real and complex number\n");
(gdb) n
enter the real and complex number
17    scanf("%f %f",&b.real,&b.img);
(gdb) n
3 5
18    result=add(a,b);
(gdb) s
add (a=..., b=...) at p10original.c:25
25    temp.real=a.real+b.real;
(gdb) c
Continuing.
sum=8.0+11.0i[Inferior 1 (process 319) exited normally]
(gdb) 