gcc -g p9original.c
 gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying
 
 gcc -g p9original.c
 gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) b main
Breakpoint 1 at 0x785: file p9original.c, line 4.
(gdb) r
Starting program: /home/runner/test-1-vishal844579/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p9original.c:4
4   {
(gdb) n
6     printf("enter the first string\n");
(gdb) n
enter the first string
7     fgets(a,100,stdin);
(gdb) n
45
8     printf("enter the second string\n");
(gdb) n
enter the second string
9     fgets(b,200,stdin);
(gdb) n
67
10    if (strcmp(a,b)==0)
(gdb) c
Continuing.
strings are not equal
[Inferior 1 (process 366) exited normally]
(gdb) l
5     char a[100],b[200];
6     printf("enter the first string\n");
7     fgets(a,100,stdin);
8     printf("enter the second string\n");
9     fgets(b,200,stdin);
10    if (strcmp(a,b)==0)
11    printf("strings are equal\n");
12    else
13    printf("strings are not equal\n");
14    return 0;
(gdb) 